tests/1-basic-http-test/1-basic-http-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.4.1">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="service_name" elementType="Argument">
            <stringProp name="Argument.name">service_name</stringProp>
            <stringProp name="Argument.value">${__BeanShell( System.getenv("service_name") )}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <kg.apc.jmeter.threads.UltimateThreadGroup guiclass="kg.apc.jmeter.threads.UltimateThreadGroupGui" testclass="kg.apc.jmeter.threads.UltimateThreadGroup" testname="APIM - Basic HTTP test" enabled="true">
        <collectionProp name="ultimatethreadgroupdata">
          <collectionProp name="1821166763">
            <stringProp name="1567">10</stringProp>
            <stringProp name="48">0</stringProp>
            <stringProp name="1722">60</stringProp>
            <stringProp name="49710">240</stringProp>
            <stringProp name="10">10</stringProp>
          </collectionProp>
          <collectionProp name="1821166763">
            <stringProp name="1567">10</stringProp>
            <stringProp reference="../../collectionProp/stringProp[2]"/>
            <stringProp reference="../../collectionProp/stringProp[3]"/>
            <stringProp reference="../../collectionProp/stringProp[4]"/>
            <stringProp reference="../../collectionProp/stringProp[5]"/>
          </collectionProp>
          <collectionProp name="1821166763">
            <stringProp name="1567">10</stringProp>
            <stringProp reference="../../collectionProp/stringProp[2]"/>
            <stringProp reference="../../collectionProp/stringProp[3]"/>
            <stringProp reference="../../collectionProp/stringProp[4]"/>
            <stringProp reference="../../collectionProp/stringProp[5]"/>
          </collectionProp>
          <collectionProp name="1821166763">
            <stringProp name="1567">10</stringProp>
            <stringProp reference="../../collectionProp/stringProp[2]"/>
            <stringProp reference="../../collectionProp/stringProp[3]"/>
            <stringProp reference="../../collectionProp/stringProp[4]"/>
            <stringProp reference="../../collectionProp/stringProp[5]"/>
          </collectionProp>
          <collectionProp name="1821166763">
            <stringProp name="1567">10</stringProp>
            <stringProp reference="../../collectionProp/stringProp[2]"/>
            <stringProp reference="../../collectionProp/stringProp[3]"/>
            <stringProp reference="../../collectionProp/stringProp[4]"/>
            <stringProp reference="../../collectionProp/stringProp[5]"/>
          </collectionProp>
          <collectionProp name="1821166763">
            <stringProp name="1567">10</stringProp>
            <stringProp reference="../../collectionProp/stringProp[2]"/>
            <stringProp reference="../../collectionProp/stringProp[3]"/>
            <stringProp reference="../../collectionProp/stringProp[4]"/>
            <stringProp reference="../../collectionProp/stringProp[5]"/>
          </collectionProp>
          <collectionProp name="1821166763">
            <stringProp name="1567">10</stringProp>
            <stringProp reference="../../collectionProp/stringProp[2]"/>
            <stringProp reference="../../collectionProp/stringProp[3]"/>
            <stringProp reference="../../collectionProp/stringProp[4]"/>
            <stringProp reference="../../collectionProp/stringProp[5]"/>
          </collectionProp>
          <collectionProp name="1821166763">
            <stringProp name="1567">10</stringProp>
            <stringProp reference="../../collectionProp/stringProp[2]"/>
            <stringProp reference="../../collectionProp/stringProp[3]"/>
            <stringProp reference="../../collectionProp/stringProp[4]"/>
            <stringProp reference="../../collectionProp/stringProp[5]"/>
          </collectionProp>
          <collectionProp name="1821166763">
            <stringProp name="1567">10</stringProp>
            <stringProp reference="../../collectionProp/stringProp[2]"/>
            <stringProp reference="../../collectionProp/stringProp[3]"/>
            <stringProp reference="../../collectionProp/stringProp[4]"/>
            <stringProp reference="../../collectionProp/stringProp[5]"/>
          </collectionProp>
          <collectionProp name="1821166763">
            <stringProp name="1567">10</stringProp>
            <stringProp reference="../../collectionProp/stringProp[2]"/>
            <stringProp reference="../../collectionProp/stringProp[3]"/>
            <stringProp reference="../../collectionProp/stringProp[4]"/>
            <stringProp reference="../../collectionProp/stringProp[5]"/>
          </collectionProp>
        </collectionProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      </kg.apc.jmeter.threads.UltimateThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="get" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${service_name}.azure-api.net</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">test1</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
          <stringProp name="HTTPSampler.connect_timeout">60000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">60000</stringProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>